app/controllers/startup_lists_controller.rb

  def index
    @startup_lists = StartupList.all
---
SELECT "startup_lists".* FROM "startup_lists"

  def create
    @startup_list = StartupList.new(startup_list_params)
    @startup_list.save
---
INSERT INTO "startup_lists" ("created_at", "name", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-25 01:52:05.456090"], ["name", "E8"], ["updated_at", "2014-11-25 01:52:05.456090"], ["url", "http://www.e8.com/"], ["user_id", -1]]

    def set_startup_list
      @startup_list = StartupList.find(params[:id])
---
SELECT  "startup_lists".* FROM "startup_lists"  WHERE "startup_lists"."id" = $1 LIMIT 1  [["id", 1]]